package com.ruoyi.runda.utils;

public enum AirFactorCodingEnum {
    A00000("a00000", "废气"),
    A01001("a01001", "温度"),
    A01002("a01002", "湿度"),
    A01006("a01006", "气压"),
    A01007("a01007", "风速"),
    A01008("a01008", "风向"),
    A01010("a01010", "林戈曼黑度"),
    A01011("a01011", "烟气流速"),
    A01012("a01012", "烟气温度"),
    A01013("a01013", "烟气压力"),
    A01014("a01014", "烟气湿度"),
    A01015("a01015", "制冷温度"),
    A01016("a01016", "烟道截面积"),
    A01017("a01017", "烟气动压"),
    A01901("a01901", "垃圾焚烧炉膛内焚烧平均温度"),
    A01902("a01902", "垃圾焚烧炉膛内DCS温度"),
    A05001("a05001", "二氧化碳"),
    A05002("a05002", "甲烷"),
    A05008("a05008", "三氯一氟甲烷"),
    A05009("a05009", "二氯二氟甲烷"),
    A05013("a05013", "三氯三氟乙烷"),
    A05024("a05024", "臭氧"),
    A19001("a01201", "氧气含量"),
    A20007("a20007", "砷"),
    A20016("a20016", "铍及其化合物"),
    A20025("a20025", "镉及其化合物"),
    A20026("a20026", "镉"),
    A20043("a20043", "铅及其化合物"),
    A20044("a20044", "铅"),
    A20057("a20057", "汞及其化合物"),
    A20058("a20058", "汞"),
    A20063("a20063", "镍及其化合物"),
    A20091("a20091", "锡及其化合物"),
    A21001("a21001", "氨(氨气)"),
    A21002("a21002", "氮氧化物"),
    A21003("a21003", "一氧化氮"),
    A21004("a21004", "二氧化氮"),
    A21005("a21005", "一氧化碳"),
    A21017("a21017", "氰化物"),
    A21018("a21018", "氟化物"),
    A21022("a21022", "氯气"),
    A21024("a21024", "氯化氢"),
    A21026("a21026", "二氧化硫"),
    A21028("a21028", "硫化氢"),
    A23001("a23001", "酚类"),
    A24003("a24003", "二氯甲烷"),
    A24004("a24004", "三氯甲烷"),
    A24005("a24005", "四氯甲烷"),
    A24006("a24006", "二溴一氯甲烷"),
    A24007("a24007", "一溴二氯甲烷"),
    A24008("a24008", "溴甲烷"),
    A24009("a24009", "三溴甲烷"),
    A24015("a24015", "氯乙烷"),
    A24016("a24016", "1,1-二氯乙烷"),
    A24017("a24017", "1,2-二氯乙烷"),
    A24018("a24018", "1,1,1-三氯乙烷"),
    A24019("a24019", "1,1,2-三氯乙烷"),
    A24020("a24020", "1,1,2,2-四氯乙烷"),
    A24027("a24027", "1,2-二氯丙烷"),
    A24034("a24034", "1,2-二溴乙烷"),
    A24036("a24036", "环己烷"),
    A24042("a24042", "正己烷"),
    A24043("a24043", "正庚烷"),
    A24046("a24046", "氯乙烯"),
    A24047("a24047", "1,1-二氯乙烯"),
    A24049("a24049", "三氯乙烯"),
    A24050("a24050", "四氯乙烯"),
    A24053("a24053", "丙烯"),
    A24054("a24054", "1,3二氯乙烯"),
    A24072("a24072", "1,4-二恶烷"),
    A24078("a24078", "1,3-丁二烯"),
    A24087("a24087", "碳氢化合物"),
    A24088("a24088", "非甲烷总烃"),
    A24099("a24099", "氯甲烷"),
    A24110("a24110", "反式-1,2-二氯乙烯"),
    A24111("a24111", "顺式-1,2-二氯乙烯"),
    A24112("a24112", "反式-1,3-二氯丙烯"),
    A24113("a24113", "六氯-1,3-丁二烯"),
    A25002("a25002", "苯"),
    A25003("a25003", "甲苯"),
    A25004("a25004", "乙苯"),
    A25005("a25005", "二甲苯"),
    A25006("a25006", "1,2-二甲基苯"),
    A25007("a25007", "1,3-二甲基苯"),
    A25008("a25008", "1,4-二甲基苯"),
    A25010("a25010", "氯苯"),
    A25011("a25011", "1,2-二氯苯"),
    A25012("a25012", "1,3-二氯苯"),
    A25013("a25013", "1,4-二氯苯"),
    A25014("a25014", "1-乙基-4-甲基苯"),
    A25015("a25015", "1,2,4-三氯苯"),
    A25019("a25019", "1,2,4-三甲基苯"),
    A25020("a25020", "1,2,3-三甲基苯"),
    A25021("a25021", "1,2,5-三甲基苯"),
    A25023("a25023", "硝基苯"),
    A25038("a25038", "乙烯基苯"),
    A25044("a25044", "苯并[a]芘"),
    A25072("a25072", "四氢呋喃"),
    A26001("a26001", "苯胺类"),
    A29017("a29017", "乙酸乙酯"),
    A29026("a29026", "乙酸乙烯酯"),
    A30001("a30001", "甲醇"),
    A30008("a30008", "异丙醇"),
    A30022("a30022", "硫醇"),
    A31001("a31001", "甲醛"),
    A31002("a31002", "乙醛"),
    A31024("a31024", "丙酮"),
    A31025("a31025", "2-丁酮"),
    A31030("a31030", "甲基异丁基甲酮"),
    A34001("a34001", "总悬浮颗粒物TSP"),
    A34002("a34002", "可吸入颗粒物PM10"),
    A34004("a34004", "细微颗粒物PM2.5"),
    A34005("a34005", "亚微米颗粒物PM10"),
    A34011("a34011", "降尘"),
    A34013("a34013", "烟尘"),
    A34017("a34017", "炭黑尘"),
    A34038("a34039", "沥青烟"),
    A34039("a34039", "硫酸雾"),
    A34040("a34040", "铬酸雾"),
    A99010("a99010", "丙烯腈"),
    A99049("a99049", "光气"),
    A99051("a99051", "二硫化碳"),
    O3("O3", "臭氧");
    private String code;
    private String description;

    AirFactorCodingEnum(String code, String description) {
        this.code = code;
        this.description = description;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getDescription() {
        return description;
    }

    public void setDescription(String description) {
        this.description = description;
    }

    /**
     * 通过编码获取中文描述
     *
     * @param code
     * @return
     */
    public static String getValue(String code) {
        for (AirFactorCodingEnum attributeType : AirFactorCodingEnum.values()) {
            if (attributeType.getCode().equals(code)) {
                return attributeType.getDescription();
            }
        }
        return null;
    }
}
